Revit 2015 API
AnnotationSymbolTypeSet.Clear Method
Removes every AnnotationSymbol type from the set, rendering it empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
AnnotationSymbolTypeSet Class
Autodesk.Revit.DB Namespace